"""""
                                    Задача 1
                                    Задание
Определите функцию filter_strings_containing_a, принимающую один параметр

    Имя - input_strs
    Тип - список строк
    Пример входа - ["apple", "banana", "cherry", "date"]

Функция должна возвращать новый список, содержащий только строки, содержащие букву «a».
"""


def filter_strings_containing_a(input_strs):
    return [s for s in input_strs if 'a' in s]


test_data = ["apple", "banana", "cherry", "pineapple", "orange", "lime", "lemon", "date"]
result = filter_strings_containing_a(test_data)

print(f"Тестовые данные: {test_data}")
print(f"Результат:       {result}")

# Разберем структуру функции filter_strings_containing_a:

""""
1. Определение функции (def):
        def filter_strings_containing_a(input_strs): — мы объявляем функцию, которая принимает один аргумент input_strs. 
        Предполагается, что это список (list) строк.

2. Тело функции (Списковое включение):
        Конструкция внутри квадратных скобок [ ... ] создает новый список.
        Внутри находится выражение: s for s in input_strs if 'a' in s.

Давайте разложим эту строку на три логические части:
•	Цикл: for s in input_strs — перебирает каждый элемент исходного списка по очереди. В каждой итерации текущая строка попадает в переменную s.
•	Условие (Фильтр): if 'a' in s — проверяет, содержится ли символ 'a' внутри строки s. Оператор in в Python очень удобен: он возвращает True, если подстрока слева найдена в строке справа.
•	Результат: s (в самом начале выражения) — если условие выполнилось, то текущая строка s добавляется в новый, формируемый список.

"""
